antmicro/ecos/packages/devs/serial/powerpc/mpc555/current/src/mpc555_serial_with_ints.c
//==========================================================================
//
//      mpc555_serial_with_ints.c
//
//      PowerPC 5xx MPC555 Serial I/O Interface Module (interrupt driven)
//
//==========================================================================
// ####ECOSGPLCOPYRIGHTBEGIN####                                            
// -------------------------------------------                              
// This file is part of eCos, the Embedded Configurable Operating System.   
// Copyright (C) 1998, 1999, 2000, 2001, 2002 Free Software Foundation, Inc.
//
// eCos is free software; you can redistribute it and/or modify it under    
// the terms of the GNU General Public License as published by the Free     
// Software Foundation; either version 2 or (at your option) any later      
// version.                                                                 
//
// eCos is distributed in the hope that it will be useful, but WITHOUT      
// ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or    
// FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License    
// for more details.                                                        
//
// You should have received a copy of the GNU General Public License        
// along with eCos; if not, write to the Free Software Foundation, Inc.,    
// 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.            
//
// As a special exception, if other files instantiate templates or use      
// macros or inline functions from this file, or you compile this file      
// and link it with other works to produce a work based on this file,       
// this file does not by itself cause the resulting work to be covered by   
// the GNU General Public License. However the source code for this file    
// must still be made available in accordance with section (3) of the GNU   
// General Public License v2.                                               
//
// This exception does not invalidate any other reasons why a work based    
// on this file might be covered by the GNU General Public License.         
// -------------------------------------------                              
// ####ECOSGPLCOPYRIGHTEND####                                              
//==========================================================================
//#####DESCRIPTIONBEGIN####
//
// Author(s):   Bob Koninckx
// Contributors:
// Date:        2002-04-25
// Purpose:     MPC555 Serial I/O module (interrupt driven version)
// Description: 
//
//   
//####DESCRIPTIONEND####
//==========================================================================
//----------------------------------
// Includes and forward declarations
//----------------------------------
#include <pkgconf/io_serial.h>
#include <pkgconf/io.h>

#include <cyg/io/io.h>
#include <cyg/hal/hal_intr.h>
#include <cyg/hal/hal_arbiter.h>
#include <cyg/io/devtab.h>
#include <cyg/infra/diag.h>
#include <cyg/io/serial.h>

// Only build this driver for the MPC555 based boards
#if defined (CYGPKG_IO_SERIAL_POWERPC_MPC555) && \
   (defined (CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_A) || \
    defined (CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_B))

#include "mpc555_serial.h"

//---------------------------------------------------------------------------
// Type definitions
//---------------------------------------------------------------------------
#define MPC555_SCI_RX_BUFF_SIZE 256
typedef struct st_sci_circbuf {
  cyg_uint8 buf[MPC555_SCI_RX_BUFF_SIZE];
  cyg_uint16 scsr[MPC555_SCI_RX_BUFF_SIZE];
  cyg_uint8 fill_pos;
  cyg_uint8 read_pos;
} mpc555_sci_circbuf_t;

typedef struct mpc555_serial_info {
  CYG_ADDRWORD   base;                 // The base address of the serial port
  CYG_WORD       tx_interrupt_num;     // trivial
  CYG_WORD       rx_interrupt_num;     // trivial
  cyg_priority_t tx_interrupt_priority;// trivial
  cyg_priority_t rx_interrupt_priority;// trivial
  bool           tx_interrupt_enable;  // can the tx interrupt be re-enabled?
  mpc555_sci_circbuf_t* rx_circbuf;    // rx buff for ISR to DSR data exchange
  bool           use_queue;            // Use the queue when available?
  CYG_WORD       rx_last_queue_pointer;// Keep track where queue read is upto
  CYG_WORD       rx_interrupt_idle_line_num;             // trivial
  CYG_WORD       tx_interrupt_queue_top_empty_num;       // trivial
  CYG_WORD       tx_interrupt_queue_bot_empty_num;       // trivial
  CYG_WORD       rx_interrupt_queue_top_full_num;        // trivial
  CYG_WORD       rx_interrupt_queue_bot_full_num;        // trivial
  cyg_priority_t rx_interrupt_idle_line_priority;        // trivial
  cyg_priority_t tx_interrupt_queue_top_empty_priority;  // trivial
  cyg_priority_t tx_interrupt_queue_bot_empty_priority;  // trivial
  cyg_priority_t rx_interrupt_queue_top_full_priority;   // trivial
  cyg_priority_t rx_interrupt_queue_bot_full_priority;   // trivial
  cyg_interrupt  tx_interrupt;                 // the tx interrupt object
  cyg_handle_t   tx_interrupt_handle;          // the tx interrupt handle
  cyg_interrupt  rx_interrupt;                 // the rx interrupt object
  cyg_handle_t   rx_interrupt_handle;          // the rx interrupt handle
  cyg_interrupt  rx_idle_interrupt;            // the rx idle line isr object
  cyg_handle_t   rx_idle_interrupt_handle;     // the rx idle line isr handle
  cyg_interrupt  tx_queue_top_interrupt;       // the tx interrupt object
  cyg_handle_t   tx_queue_top_interrupt_handle;// the tx interrupt handle
  cyg_interrupt  tx_queue_bot_interrupt;       // the tx interrupt object
  cyg_handle_t   tx_queue_bot_interrupt_handle;// the tx interrupt handle
  cyg_interrupt  rx_queue_top_interrupt;       // the tx interrupt object
  cyg_handle_t   rx_queue_top_interrupt_handle;// the tx interrupt handle
  cyg_interrupt  rx_queue_bot_interrupt;       // the tx interrupt object
  cyg_handle_t   rx_queue_bot_interrupt_handle;// the tx interrupt handle
} mpc555_serial_info;

//--------------------
// Function prototypes
//--------------------
static bool mpc555_serial_putc(serial_channel * chan, unsigned char c);
static unsigned char mpc555_serial_getc(serial_channel *chan);
static Cyg_ErrNo mpc555_serial_set_config(serial_channel *chan, cyg_uint32 key,
                                          const void *xbuf, cyg_uint32 *len);
static void mpc555_serial_start_xmit(serial_channel *chan);
static void mpc555_serial_stop_xmit(serial_channel *chan);
static Cyg_ErrNo mpc555_serial_lookup(struct cyg_devtab_entry ** tab, 
                                      struct cyg_devtab_entry * sub_tab,
                                      const char * name);
static bool mpc555_serial_init(struct cyg_devtab_entry * tab);

