antmicro/ecos/packages/devs/serial/powerpc/mpc555/current/src/mpc555_serial_with_ints.c
// The interrupt servers
static cyg_uint32 mpc555_serial_tx_ISR(cyg_vector_t vector, cyg_addrword_t data);
static cyg_uint32 mpc555_serial_rx_ISR(cyg_vector_t vector, cyg_addrword_t data);
static void mpc555_serial_tx_DSR(cyg_vector_t vector, 
                                 cyg_ucount32 count, 
                                 cyg_addrword_t data);
static void mpc555_serial_rx_DSR(cyg_vector_t vector, 
                                 cyg_ucount32 count,
                                 cyg_addrword_t data);

#ifdef CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_A
static cyg_uint32 mpc555_serial_tx_queue_top_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data);
static cyg_uint32 mpc555_serial_tx_queue_bot_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data);
static cyg_uint32 mpc555_serial_rx_queue_top_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data);
static cyg_uint32 mpc555_serial_rx_queue_bot_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data);
static cyg_uint32 mpc555_serial_rx_idle_line_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data);

static void mpc555_serial_tx_queue_DSR(cyg_vector_t vector,
                                       cyg_ucount32 count,
                                       cyg_addrword_t data);
static void mpc555_serial_rx_queue_DSR(cyg_vector_t vector,
                                       cyg_ucount32 count,
                                       cyg_addrword_t data);

static int mpc555_serial_read_queue(serial_channel* chan, int start, int end);
#endif

//------------------------------------------------------------------------------
// Register the device driver with the kernel
//------------------------------------------------------------------------------
static SERIAL_FUNS(mpc555_serial_funs, 
                   mpc555_serial_putc, 
                   mpc555_serial_getc,
                   mpc555_serial_set_config,
                   mpc555_serial_start_xmit,
                   mpc555_serial_stop_xmit);

//------------------------------------------------------------------------------
// Device driver data
//------------------------------------------------------------------------------
#ifdef CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_A
#ifdef CYGDAT_IO_SERIAL_POWERPC_MPC555_SERIAL_A_USE_HWARE_QUEUE
//static mpc555_sci_circbuf_t mpc555_serial_isr_to_dsr_buf0;

static mpc555_serial_info mpc555_serial_info0 = {
  MPC555_SERIAL_BASE_A,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX_PRIORITY,
  false,
  NULL, // Don't need software buffer
  true, // Use queue
  0,    // init queue pointer
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_IDLE, 
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TXQTHE,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TXQBHE,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RXQTHF,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RXQBHF,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_IDLE_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TXQTHE_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TXQBHE_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RXQTHF_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RXQBHF_PRIORITY};

static unsigned char mpc555_serial_out_buf0[CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BUFSIZE]; 
static unsigned char mpc555_serial_in_buf0[CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
  mpc555_serial_channel0,
  mpc555_serial_funs,
  mpc555_serial_info0,
  CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BAUD),
  CYG_SERIAL_STOP_DEFAULT,
  CYG_SERIAL_PARITY_DEFAULT,
  CYG_SERIAL_WORD_LENGTH_DEFAULT,
  CYG_SERIAL_FLAGS_DEFAULT,
  &mpc555_serial_out_buf0[0],
  sizeof(mpc555_serial_out_buf0),
  &mpc555_serial_in_buf0[0],
  sizeof(mpc555_serial_in_buf0));

#elif CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BUFSIZE > 0
static mpc555_sci_circbuf_t mpc555_serial_isr_to_dsr_buf0;

static mpc555_serial_info mpc555_serial_info0 = {
  MPC555_SERIAL_BASE_A,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX_PRIORITY,
  false,
  &mpc555_serial_isr_to_dsr_buf0,
  false};

static unsigned char mpc555_serial_out_buf0[CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BUFSIZE]; 
static unsigned char mpc555_serial_in_buf0[CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
  mpc555_serial_channel0,
  mpc555_serial_funs,
  mpc555_serial_info0,
  CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BAUD),
  CYG_SERIAL_STOP_DEFAULT,
  CYG_SERIAL_PARITY_DEFAULT,
  CYG_SERIAL_WORD_LENGTH_DEFAULT,
  CYG_SERIAL_FLAGS_DEFAULT,
  &mpc555_serial_out_buf0[0],
  sizeof(mpc555_serial_out_buf0),
  &mpc555_serial_in_buf0[0],
  sizeof(mpc555_serial_in_buf0));
#else
static mpc555_serial_info mpc555_serial_info0 = {
  MPC555_SERIAL_BASE_A,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX_PRIORITY,
  false,
  NULL,
  false};
 
static SERIAL_CHANNEL(
  mpc555_serial_channel0,
  mpc555_serial_funs,
  mpc555_serial_info0,
  CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_A_BAUD),
  CYG_SERIAL_STOP_DEFAULT,
  CYG_SERIAL_PARITY_DEFAULT,
  CYG_SERIAL_WORD_LENGTH_DEFAULT,
  CYG_SERIAL_FLAGS_DEFAULT);
#endif
DEVTAB_ENTRY(mpc555_serial_io0,
             CYGDAT_IO_SERIAL_POWERPC_MPC555_SERIAL_A_NAME,
             0, // does not depend on a lower level device driver
             &cyg_io_serial_devio,
             mpc555_serial_init,
             mpc555_serial_lookup,
             &mpc555_serial_channel0);
#endif // ifdef CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_A

#ifdef CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_B

#if CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_B_BUFSIZE > 0
static mpc555_sci_circbuf_t mpc555_serial_isr_to_dsr_buf1;

static mpc555_serial_info mpc555_serial_info1 = {
  MPC555_SERIAL_BASE_B,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI2_TX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI2_RX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI2_TX_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI2_RX_PRIORITY,
  false,
  &mpc555_serial_isr_to_dsr_buf1,
  false};

static unsigned char mpc555_serial_out_buf1[CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_B_BUFSIZE]; 
static unsigned char mpc555_serial_in_buf1[CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_B_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
  mpc555_serial_channel1,
  mpc555_serial_funs,
  mpc555_serial_info1,
  CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_B_BAUD),
  CYG_SERIAL_STOP_DEFAULT,
  CYG_SERIAL_PARITY_DEFAULT,
  CYG_SERIAL_WORD_LENGTH_DEFAULT,
  CYG_SERIAL_FLAGS_DEFAULT,
  &mpc555_serial_out_buf1[0],
  sizeof(mpc555_serial_out_buf1),
  &mpc555_serial_in_buf1[0],
  sizeof(mpc555_serial_in_buf1));
#else
static mpc555_serial_info mpc555_serial_info1 = {
  MPC555_SERIAL_BASE_B,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_TX_PRIORITY,
  CYGNUM_HAL_INTERRUPT_IMB3_SCI1_RX_PRIORITY,
  false,
  NULL,
  false};
static SERIAL_CHANNEL(
  mpc555_serial_channel1,
  mpc555_serial_funs,
  mpc555_serial_info1,
  CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_POWERPC_MPC555_SERIAL_B_BAUD),
  CYG_SERIAL_STOP_DEFAULT,
  CYG_SERIAL_PARITY_DEFAULT,
  CYG_SERIAL_WORD_LENGTH_DEFAULT,
  CYG_SERIAL_FLAGS_DEFAULT);
#endif
DEVTAB_ENTRY(mpc555_serial_io1,
             CYGDAT_IO_SERIAL_POWERPC_MPC555_SERIAL_B_NAME,
             0, // does not depend on a lower level device driver
             &cyg_io_serial_devio,
             mpc555_serial_init,
             mpc555_serial_lookup,
             &mpc555_serial_channel1);
#endif // ifdef CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_B

//------------------------------------------------------------------------------
// Device driver implementation
//------------------------------------------------------------------------------

// The arbitration isr. 
// I think this is the best place to implement it.
// The device driver is the only place in the code where the knowledge is 
// present about how the hardware is used.
//
// Always check receive interrupts. 
// Some rom monitor might be waiting for CTRL-C
static cyg_uint32 hal_arbitration_isr_qsci(CYG_ADDRWORD a_vector, 
                                           CYG_ADDRWORD a_data)
{
  cyg_uint16 status;
  cyg_uint16 control;

