antmicro/ecos/packages/devs/serial/powerpc/mpc555/current/src/mpc555_serial_with_ints.c
  if(frame_length == 11)
    sccxr |= (cyg_uint16)MPC555_SERIAL_SCCxR1_M;
  else
    sccxr &= ~((cyg_uint16)MPC555_SERIAL_SCCxR1_M);

  switch(new_config->parity){
    case CYGNUM_SERIAL_PARITY_NONE:
      sccxr &= ~((cyg_uint16)MPC555_SERIAL_SCCxR1_PE);
      break;
    case CYGNUM_SERIAL_PARITY_EVEN:
      sccxr |= (cyg_uint16)MPC555_SERIAL_SCCxR1_PE;
      sccxr &= ~((cyg_uint16)MPC555_SERIAL_SCCxR1_PT);
      break;
    case CYGNUM_SERIAL_PARITY_ODD:
      sccxr |= (cyg_uint16)MPC555_SERIAL_SCCxR1_PE;
      sccxr |= (cyg_uint16)MPC555_SERIAL_SCCxR1_PT;
      break;
    default:
      break;
  }
  HAL_WRITE_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);

  // Set baud rate.
  baud_rate &= ~((cyg_uint16)MPC555_SERIAL_SCCxR0_OTHR);
  baud_rate &= ~((cyg_uint16)MPC555_SERIAL_SCCxR0_LINKBD);
  HAL_READ_UINT16(port + MPC555_SERIAL_SCCxR0, sccxr);
  sccxr &= ~(MPC555_SERIAL_SCCxR0_SCxBR);
  sccxr |= baud_rate;
  HAL_WRITE_UINT16(port + MPC555_SERIAL_SCCxR0, sccxr);

  // Enable the device
  HAL_READ_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);
  sccxr |= MPC555_SERIAL_SCCxR1_TE;
  sccxr |= MPC555_SERIAL_SCCxR1_RE;
  HAL_WRITE_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);

  if(init){ 
#ifdef CYGDAT_IO_SERIAL_POWERPC_MPC555_SERIAL_A_USE_HWARE_QUEUE
    HAL_READ_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);
    if(mpc555_chan->use_queue){
      cyg_uint16 qsci1sr;
      // enable read queue
      qsci1cr |= ((cyg_uint16)CYGARC_REG_IMM_QSCI1CR_QRE);
      // enable receive queue interrupts    
      qsci1cr |= ((cyg_uint16)CYGARC_REG_IMM_QSCI1CR_QTHFI);
      qsci1cr |= ((cyg_uint16)CYGARC_REG_IMM_QSCI1CR_QBHFI);
      HAL_WRITE_UINT16( CYGARC_REG_IMM_QSCI1CR, qsci1cr);
      // also enable idle line detect interrupt
      sccxr |= MPC555_SERIAL_SCxSR_IDLE;
      HAL_READ_UINT16( CYGARC_REG_IMM_QSCI1SR, qsci1sr);
      qsci1sr &= ~((cyg_uint16)CYGARC_REG_IMM_QSCI1SR_QBHF);
      qsci1sr &= ~((cyg_uint16)CYGARC_REG_IMM_QSCI1SR_QTHF);
      HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qsci1sr);
    }
    else {
      // enable the receiver interrupt
      sccxr |= MPC555_SERIAL_SCCxR1_RIE;
    }
    HAL_WRITE_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);
#else
    // enable the receiver interrupt
    HAL_READ_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);
    sccxr |= MPC555_SERIAL_SCCxR1_RIE;
    HAL_WRITE_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);
#endif
  } 
  else {// Restore the old interrupt state
  
    HAL_READ_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);
    sccxr |= old_isrstate;
    HAL_WRITE_UINT16(port + MPC555_SERIAL_SCCxR1, sccxr);
  }

  if(new_config != &chan->config) 
    chan->config = *new_config;

  return true;
}

//------------------------------------------------------------------------------
// Function to initialize the device.  Called at bootstrap time.
//------------------------------------------------------------------------------
static hal_mpc5xx_arbitration_data arbiter;
static bool mpc555_serial_init(struct cyg_devtab_entry * tab){
   serial_channel * chan = (serial_channel *)tab->priv;
   mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

   if(!mpc555_serial_config_port(chan, &chan->config, true))
     return false;

   // Really only required for interrupt driven devices
   (chan->callbacks->serial_init)(chan);
   if(chan->out_cbuf.len != 0){ 
     arbiter.priority = CYGNUM_HAL_ISR_SOURCE_PRIORITY_QSCI;
     arbiter.data     = 0;
     arbiter.arbiter  = hal_arbitration_isr_qsci;
     
     // Install the arbitration isr, Make sure that is is not installed twice
     hal_mpc5xx_remove_arbitration_isr(CYGNUM_HAL_ISR_SOURCE_PRIORITY_QSCI);
     hal_mpc5xx_install_arbitration_isr(&arbiter); 

     // if !(Chan_B && using queue) 
     if(!mpc555_chan->use_queue){
       mpc555_chan->rx_circbuf->fill_pos = 0;
       mpc555_chan->rx_circbuf->read_pos = 0;
     
       // Create the Tx interrupt, do not enable it yet
       cyg_drv_interrupt_create(mpc555_chan->tx_interrupt_num,
                                mpc555_chan->tx_interrupt_priority,
                                (cyg_addrword_t)chan,//Data item passed to isr
                                mpc555_serial_tx_ISR,
                                mpc555_serial_tx_DSR,
                                &mpc555_chan->tx_interrupt_handle,
                                &mpc555_chan->tx_interrupt);
       cyg_drv_interrupt_attach(mpc555_chan->tx_interrupt_handle);
  
       // Create the Rx interrupt, this can be safely unmasked now
       cyg_drv_interrupt_create(mpc555_chan->rx_interrupt_num,
                                mpc555_chan->rx_interrupt_priority,
                                (cyg_addrword_t)chan,
                                mpc555_serial_rx_ISR,
                                mpc555_serial_rx_DSR,
                                &mpc555_chan->rx_interrupt_handle,
                                &mpc555_chan->rx_interrupt);
       cyg_drv_interrupt_attach(mpc555_chan->rx_interrupt_handle);
       cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_num);
     }
#ifdef CYGDAT_IO_SERIAL_POWERPC_MPC555_SERIAL_A_USE_HWARE_QUEUE
     else {// Use HW queue
       // Create the Tx interrupt, do not enable it yet
       cyg_drv_interrupt_create(mpc555_chan->tx_interrupt_queue_top_empty_num,
                                mpc555_chan->tx_interrupt_queue_top_empty_priority,
                                (cyg_addrword_t)chan,//Data item passed to isr
                                mpc555_serial_tx_queue_top_ISR,
                                mpc555_serial_tx_queue_DSR,
                                &mpc555_chan->tx_queue_top_interrupt_handle,
                                &mpc555_chan->tx_queue_top_interrupt);
       cyg_drv_interrupt_attach(mpc555_chan->tx_queue_top_interrupt_handle);


       cyg_drv_interrupt_create(mpc555_chan->tx_interrupt_queue_bot_empty_num,
                                mpc555_chan->tx_interrupt_queue_bot_empty_priority,
                                (cyg_addrword_t)chan,//Data passed to isr
                                mpc555_serial_tx_queue_bot_ISR,
                                mpc555_serial_tx_queue_DSR,
                                &mpc555_chan->tx_queue_bot_interrupt_handle,
                                &mpc555_chan->tx_queue_bot_interrupt);
       cyg_drv_interrupt_attach(mpc555_chan->tx_queue_bot_interrupt_handle);
       
       // Rx queue interrupts
       cyg_drv_interrupt_create(mpc555_chan->rx_interrupt_queue_top_full_num,
                                mpc555_chan->rx_interrupt_queue_top_full_priority,
                                (cyg_addrword_t)chan,//Data item passed to isr
                                mpc555_serial_rx_queue_top_ISR,
                                mpc555_serial_rx_queue_DSR,
                                &mpc555_chan->rx_queue_top_interrupt_handle,
                                &mpc555_chan->rx_queue_top_interrupt);
       cyg_drv_interrupt_attach(mpc555_chan->rx_queue_top_interrupt_handle);
       
       cyg_drv_interrupt_create(mpc555_chan->rx_interrupt_queue_bot_full_num,
                                mpc555_chan->rx_interrupt_queue_bot_full_priority,
                                (cyg_addrword_t)chan,//Data item passed to isr
                                mpc555_serial_rx_queue_bot_ISR,
                                mpc555_serial_rx_queue_DSR,
                                &mpc555_chan->rx_queue_bot_interrupt_handle,
                                &mpc555_chan->rx_queue_bot_interrupt);
       cyg_drv_interrupt_attach(mpc555_chan->rx_queue_bot_interrupt_handle);
       
       cyg_drv_interrupt_create(mpc555_chan->rx_interrupt_idle_line_num,
                                mpc555_chan->rx_interrupt_idle_line_priority,
                                (cyg_addrword_t)chan,//Data item passed to isr
                                mpc555_serial_rx_idle_line_ISR,
                                mpc555_serial_rx_queue_DSR,
                                &mpc555_chan->rx_idle_interrupt_handle,
                                &mpc555_chan->rx_idle_interrupt);
       cyg_drv_interrupt_attach(mpc555_chan->rx_idle_interrupt_handle);
     }
#endif // use queue
   }
    return true;
}

//----------------------------------------------------------------------------
// This routine is called when the device is "looked" up (i.e. attached)
//----------------------------------------------------------------------------
static Cyg_ErrNo mpc555_serial_lookup(struct cyg_devtab_entry ** tab, 
                                      struct cyg_devtab_entry * sub_tab,
                                      const char * name)
{
  serial_channel * chan = (serial_channel *)(*tab)->priv;
  //Really only required for interrupt driven devices
  (chan->callbacks->serial_init)(chan);

