antmicro/ecos/packages/devs/serial/powerpc/mpc555/current/src/mpc555_serial_with_ints.c
  return ENOERR;
}

//----------------------------------------------------------------------------
// Send a character to the device output buffer.
// Return 'true' if character is sent to device
//----------------------------------------------------------------------------
static bool mpc555_serial_putc(serial_channel * chan, unsigned char c){
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;
  cyg_addrword_t port = mpc555_chan->base;

  cyg_uint16 scsr;
  cyg_uint16 scdr;

  HAL_READ_UINT16(port + MPC555_SERIAL_SCxSR, scsr);
  if(scsr & MPC555_SERIAL_SCxSR_TDRE){ 
    // Ok, we have space, write the character and return success
    scdr = (cyg_uint16)c;
    HAL_WRITE_UINT16(port + MPC555_SERIAL_SCxDR, scdr);
    return true;
  }  
  else
    // We cannot write to the transmitter, return failure
    return false;
}

//----------------------------------------------------------------------------
// Fetch a character from the device input buffer, waiting if necessary
//----------------------------------------------------------------------------
static unsigned char mpc555_serial_getc(serial_channel * chan){
  unsigned char c;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;
  cyg_addrword_t port = mpc555_chan->base;

  cyg_uint16 scsr;
  cyg_uint16 scdr;

  do {
    HAL_READ_UINT16(port + MPC555_SERIAL_SCxSR, scsr);
  } while(!(scsr & MPC555_SERIAL_SCxSR_RDRF));

  // Ok, data is received, read it out and return
  HAL_READ_UINT16(port + MPC555_SERIAL_SCxDR, scdr);
  c = (unsigned char)scdr;

  return c;
}

//----------------------------------------------------------------------------
// Set up the device characteristics; baud rate, etc.
//----------------------------------------------------------------------------
static bool mpc555_serial_set_config(serial_channel * chan, cyg_uint32 key,
                                     const void *xbuf, cyg_uint32 * len)
{
  switch(key){
    case CYG_IO_SET_CONFIG_SERIAL_INFO:{
      cyg_serial_info_t *config = (cyg_serial_info_t *)xbuf;
      if(*len < sizeof(cyg_serial_info_t)){
        return -EINVAL;
      }
      *len = sizeof(cyg_serial_info_t);
      if(true != mpc555_serial_config_port(chan, config, false))
        return -EINVAL;
      }
    break;
  default:
    return -EINVAL;
  }
  return ENOERR;
}

//------------------------------------------------------------------------------
// Enable the transmitter on the device
//------------------------------------------------------------------------------
static void mpc555_serial_start_xmit(serial_channel * chan)
{
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;
#ifdef CYGDAT_IO_SERIAL_POWERPC_MPC555_SERIAL_A_USE_HWARE_QUEUE
  cyg_addrword_t port = mpc555_chan->base;
  if(mpc555_chan->use_queue){
    cyg_uint16 qscicr;
    cyg_uint16 qscisr;
    cyg_uint16 scsr;
    
    int chars_avail;
    unsigned char* chars;
    int block_index = 0;
    cyg_addrword_t i;
    cyg_uint16 queue_transfer;
 
    if(!(mpc555_chan->tx_interrupt_enable) && 
       (chan->callbacks->data_xmt_req)(chan, 32, &chars_avail, &chars) 
       == CYG_XMT_OK){
      queue_transfer = (chars_avail > 16) ? 16 : chars_avail;

      HAL_READ_UINT16( CYGARC_REG_IMM_QSCI1CR, qscicr);
      // Write QTSZ for first pass through the queue
      qscicr &= ~(CYGARC_REG_IMM_QSCI1CR_QTSZ);
      qscicr |= (CYGARC_REG_IMM_QSCI1CR_QTSZ & (queue_transfer - 1));
      HAL_WRITE_UINT16( CYGARC_REG_IMM_QSCI1CR, qscicr);
      // Read SC1SR to clear TC bit when followed by a write of sctq
      HAL_READ_UINT16(port + MPC555_SERIAL_SCxSR, scsr);
      
      for(i=0; i < queue_transfer; i++){
        HAL_WRITE_UINT16(CYGARC_REG_IMM_SCTQ + (i * 2), chars[block_index]);
        ++block_index;
      }
      chan->callbacks->data_xmt_done(chan, queue_transfer);

      // clear QTHE and QBHE
      HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);

      qscisr &= ~(CYGARC_REG_IMM_QSCI1SR_QTHE);
      HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
      if(queue_transfer > 8){
        qscisr &= ~(CYGARC_REG_IMM_QSCI1SR_QBHE);
        HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
      }

      mpc555_chan->tx_interrupt_enable = true;

      cyg_drv_interrupt_unmask(mpc555_chan->tx_interrupt_queue_top_empty_num);
      if(queue_transfer > 8){
        cyg_drv_interrupt_unmask(mpc555_chan->tx_interrupt_queue_bot_empty_num);
      }

      HAL_READ_UINT16( CYGARC_REG_IMM_QSCI1CR, qscicr);
      qscicr |= ((cyg_uint16)CYGARC_REG_IMM_QSCI1CR_QTE);
      HAL_WRITE_UINT16( CYGARC_REG_IMM_QSCI1CR, qscicr);
    }
  }
  else { // no queue  
   mpc555_chan->tx_interrupt_enable = true;
   cyg_drv_interrupt_unmask(mpc555_chan->tx_interrupt_num);
// No need to call xmt_char, this will generate an interrupt immediately.
  }
#else // No queue
   mpc555_chan->tx_interrupt_enable = true;
   cyg_drv_interrupt_unmask(mpc555_chan->tx_interrupt_num);
// No need to call xmt_char, this will generate an interrupt immediately.
#endif
}

//----------------------------------------------------------------------------
// Disable the transmitter on the device
//----------------------------------------------------------------------------
static void mpc555_serial_stop_xmit(serial_channel * chan){
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  if(!mpc555_chan->use_queue){
    cyg_drv_dsr_lock();
    mpc555_chan->tx_interrupt_enable = false;
    cyg_drv_interrupt_mask(mpc555_chan->tx_interrupt_num);
    cyg_drv_dsr_unlock();
  }
}

//----------------------------------------------------------------------------
// The low level transmit interrupt handler
//----------------------------------------------------------------------------
static cyg_uint32 mpc555_serial_tx_ISR(cyg_vector_t vector,
                                       cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  cyg_drv_interrupt_mask(mpc555_chan->tx_interrupt_num);
  cyg_drv_interrupt_acknowledge(mpc555_chan->tx_interrupt_num);

  return CYG_ISR_CALL_DSR; // cause the DSR to run
}

//----------------------------------------------------------------------------
// The low level receive interrupt handler
//----------------------------------------------------------------------------
static cyg_uint32 mpc555_serial_rx_ISR(cyg_vector_t vector, 
                                       cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  cyg_drv_interrupt_mask(mpc555_chan->rx_interrupt_num);
  cyg_drv_interrupt_acknowledge(mpc555_chan->rx_interrupt_num);

  cyg_addrword_t port = mpc555_chan->base;
  cyg_uint16 scdr;
  cyg_uint16 scsr;

