antmicro/ecos/packages/devs/serial/powerpc/mpc555/current/src/mpc555_serial_with_ints.c
  HAL_READ_UINT16(port + MPC555_SERIAL_SCxSR, scsr);
  // Always read out the received character, in order to clear receiver flags
  HAL_READ_UINT16(port + MPC555_SERIAL_SCxDR, scdr);
  
  mpc555_chan->rx_circbuf->scsr[mpc555_chan->rx_circbuf->fill_pos] = scsr;
  mpc555_chan->rx_circbuf->buf[mpc555_chan->rx_circbuf->fill_pos] = (cyg_uint8)scdr;

  if(mpc555_chan->rx_circbuf->fill_pos < MPC555_SCI_RX_BUFF_SIZE - 1){
    mpc555_chan->rx_circbuf->fill_pos = mpc555_chan->rx_circbuf->fill_pos + 1;
  }
  else {
    mpc555_chan->rx_circbuf->fill_pos = 0;
  }
  cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_num);
  return CYG_ISR_CALL_DSR; // cause the DSR to run
}

#ifdef CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_A
//----------------------------------------------------------------------------
// The low level queued receive interrupt handlers
//----------------------------------------------------------------------------
static cyg_uint32 mpc555_serial_rx_queue_top_ISR(cyg_vector_t vector, 
                                                 cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  cyg_drv_interrupt_mask(mpc555_chan->rx_interrupt_queue_top_full_num);
  cyg_drv_interrupt_acknowledge(mpc555_chan->rx_interrupt_queue_top_full_num);

  return CYG_ISR_CALL_DSR; // cause the DSR to run
}

static cyg_uint32 mpc555_serial_rx_queue_bot_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data){
  serial_channel* chan = (serial_channel *)data;
  mpc555_serial_info* mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  cyg_drv_interrupt_mask(mpc555_chan->rx_interrupt_queue_bot_full_num);
  cyg_drv_interrupt_acknowledge(mpc555_chan->rx_interrupt_queue_bot_full_num);

  return CYG_ISR_CALL_DSR; // cause the DSR to run
}

// This is used to flush the queue when the line falls idle
static cyg_uint32 mpc555_serial_rx_idle_line_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data){
  serial_channel* chan = (serial_channel *)data;
  mpc555_serial_info* mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  cyg_drv_interrupt_mask(mpc555_chan->rx_interrupt_idle_line_num);
  cyg_drv_interrupt_acknowledge(mpc555_chan->rx_interrupt_idle_line_num);

  return CYG_ISR_CALL_DSR; // cause the DSR to run
}

//----------------------------------------------------------------------------
// The low level queued transmit interrupt handlers
//----------------------------------------------------------------------------
static cyg_uint32 mpc555_serial_tx_queue_top_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  cyg_drv_interrupt_mask(mpc555_chan->tx_interrupt_queue_top_empty_num);
  cyg_drv_interrupt_acknowledge(mpc555_chan->tx_interrupt_queue_top_empty_num);

  return CYG_ISR_CALL_DSR; // cause the DSR to run
}

static cyg_uint32 mpc555_serial_tx_queue_bot_ISR(cyg_vector_t vector,
                                                 cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  cyg_drv_interrupt_mask(mpc555_chan->tx_interrupt_queue_bot_empty_num);
  cyg_drv_interrupt_acknowledge(mpc555_chan->tx_interrupt_queue_bot_empty_num);

  return CYG_ISR_CALL_DSR; // cause the DSR to run
}
#endif // SERIAL_A

//----------------------------------------------------------------------------
// The high level transmit interrupt handler
//----------------------------------------------------------------------------
static void mpc555_serial_tx_DSR(cyg_vector_t vector, cyg_ucount32 count,
                                 cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;

  (chan->callbacks->xmt_char)(chan);
  if(mpc555_chan->tx_interrupt_enable)
    cyg_drv_interrupt_unmask(mpc555_chan->tx_interrupt_num);
}

//----------------------------------------------------------------------------
// The high level receive interrupt handler
//----------------------------------------------------------------------------
#define MPC555_SERIAL_SCxSR_ERRORS (MPC555_SERIAL_SCxSR_OR | \
                                    MPC555_SERIAL_SCxSR_NF | \
                                    MPC555_SERIAL_SCxSR_FE | \
                                    MPC555_SERIAL_SCxSR_PF)

static void mpc555_serial_rx_DSR(cyg_vector_t vector, cyg_ucount32 count, 
                                 cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;
//  cyg_addrword_t port = mpc555_chan->base;
//  cyg_uint16 scdr;
  cyg_uint16 scsr;

#ifdef CYGOPT_IO_SERIAL_SUPPORT_LINE_STATUS
  cyg_serial_line_status_t stat;
#endif


  int i = mpc555_chan->rx_circbuf->read_pos;
  while (i < mpc555_chan->rx_circbuf->fill_pos){
     scsr = mpc555_chan->rx_circbuf->scsr[i];
     if(scsr & (cyg_uint16)MPC555_SERIAL_SCxSR_ERRORS){
#ifdef CYGOPT_IO_SERIAL_SUPPORT_LINE_STATUS
       if(scsr & MPC555_SERIAL_SCxSR_OR){
         stat.which = CYGNUM_SERIAL_STATUS_OVERRUNERR;
         (chan->callbacks->indicate_status)(chan, &stat);
         // The current byte is still valid when OR is set
         (chan->callbacks->rcv_char)(chan, mpc555_chan->rx_circbuf->buf[i]);
       } 
       else { // OR is never set with any other error bits
         if(scsr & MPC555_SERIAL_SCxSR_NF){
           stat.which = CYGNUM_SERIAL_STATUS_NOISEERR;
           (chan->callbacks->indicate_status)(chan, &stat);
         } 
         if(scsr & MPC555_SERIAL_SCxSR_FE){
           stat.which = CYGNUM_SERIAL_STATUS_FRAMEERR;
           (chan->callbacks->indicate_status)(chan, &stat);
         }   
         if(scsr & MPC555_SERIAL_SCxSR_PF){
           stat.which = CYGNUM_SERIAL_STATUS_PARITYERR;
           (chan->callbacks->indicate_status)(chan, &stat);
         }
       }
#endif
     } 
     else {
       (chan->callbacks->rcv_char)(chan, mpc555_chan->rx_circbuf->buf[i]);
     }
     ++i;
  } 

    cyg_drv_isr_lock();
    mpc555_chan->rx_circbuf->fill_pos = 0;
    mpc555_chan->rx_circbuf->read_pos = 0;
    cyg_drv_isr_unlock();
}

#ifdef CYGPKG_IO_SERIAL_POWERPC_MPC555_SERIAL_A
//----------------------------------------------------------------------------
// The high level queued transmit interrupt handler
//----------------------------------------------------------------------------
static void mpc555_serial_tx_queue_DSR(cyg_vector_t vector, cyg_ucount32 count, 
                                       cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;
  bool QTHE = false;
  bool QBHE = false;
  cyg_uint16 qscisr;
  cyg_uint16 qscicr;
  HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
  QTHE = (qscisr & CYGARC_REG_IMM_QSCI1SR_QTHE) ? true : false;
  QBHE = (qscisr & CYGARC_REG_IMM_QSCI1SR_QBHE) ? true : false;
  
  CYG_ASSERT(QTHE || QBHE,"In tx queue DSR for no reason");

  HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1CR, qscicr);
  int chars_avail;
  unsigned char* chars;
  int block_index = 0;
  cyg_addrword_t i;
  cyg_uint16 queue_transfer;
  xmt_req_reply_t result = (chan->callbacks->data_xmt_req)(chan, 24, &chars_avail, &chars);
  if(CYG_XMT_OK == result){
    queue_transfer = (chars_avail > 8) ? 8 : chars_avail;
    if(QTHE){
      for(i=0; i < queue_transfer; i++){
        HAL_WRITE_UINT16(CYGARC_REG_IMM_SCTQ + (i * 2), chars[block_index]);
        ++block_index;
      }
      chan->callbacks->data_xmt_done(chan, queue_transfer);
      // Clear QTHE
      qscisr &= ~(CYGARC_REG_IMM_QSCI1SR_QTHE);
      HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
      
      // Re-enable wrap QTWE
      HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1CR, qscicr);
      qscicr |= ((cyg_uint16)CYGARC_REG_IMM_QSCI1CR_QTWE);
      HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1CR, qscicr);
      HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1CR, qscicr);
      // load QTSZ with how many chars *after* the next wrap
      cyg_uint16 next_time = (chars_avail) > 16 ? 15 : chars_avail -1; 
      qscicr &= ~(CYGARC_REG_IMM_QSCI1CR_QTSZ);
      qscicr |= (CYGARC_REG_IMM_QSCI1CR_QTSZ & next_time);
      HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1CR, qscicr);
      cyg_drv_interrupt_unmask(mpc555_chan->tx_interrupt_queue_top_empty_num);
    }
    else if(QBHE){
      for(i=8; i < queue_transfer + 8; i++){
        HAL_WRITE_UINT16(CYGARC_REG_IMM_SCTQ + (i * 2), chars[block_index]);
        ++block_index;
      }
      chan->callbacks->data_xmt_done(chan, queue_transfer);
      // Clear QBHE
      qscisr &= ~(CYGARC_REG_IMM_QSCI1SR_QBHE);
      HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
      cyg_drv_interrupt_unmask(mpc555_chan->tx_interrupt_queue_bot_empty_num);
    }

