antmicro/ecos/packages/devs/serial/powerpc/mpc555/current/src/mpc555_serial_with_ints.c
  }   
  else if(CYG_XMT_EMPTY== result){
    // No more data
    cyg_drv_interrupt_mask(mpc555_chan->tx_interrupt_queue_top_empty_num);
    cyg_drv_interrupt_mask(mpc555_chan->tx_interrupt_queue_bot_empty_num);
    mpc555_chan->tx_interrupt_enable = false;

    // Clear QTHE
    HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
    qscisr &= ~(CYGARC_REG_IMM_QSCI1SR_QTHE);
    HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
  }
}

//----------------------------------------------------------------------------
// The high level queued receive interrupt handler
//----------------------------------------------------------------------------
static void mpc555_serial_rx_queue_DSR(cyg_vector_t vector, 
                                       cyg_ucount32 count, cyg_addrword_t data){
  serial_channel * chan = (serial_channel *)data;
  mpc555_serial_info * mpc555_chan = (mpc555_serial_info *)chan->dev_priv;
  cyg_addrword_t port = mpc555_chan->base;
  cyg_uint16 scrq;
  cyg_uint16 qscisr;
  cyg_uint16 scsr;
  cyg_uint16 scdr;
  bool QTHF = false;
  bool QBHF = false;
  bool idle = false;
  // Read status reg before reading any data otherwise NE flag will be lost
  HAL_READ_UINT16(port + MPC555_SERIAL_SCxSR, scsr);
  HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
  QTHF = (qscisr & CYGARC_REG_IMM_QSCI1SR_QTHF) ? true : false;
  QBHF = (qscisr & CYGARC_REG_IMM_QSCI1SR_QBHF) ? true : false;
  idle = (scsr & CYGARC_REG_IMM_SCxSR_IDLE)? true : false;
  // The queue pointer is the next place to be filled by incomming data
  cyg_uint16 queue_pointer = (qscisr & CYGARC_REG_IMM_QSCI1SR_QRPNT) >> 4;

  int start;
  int space_req = 0;
  // Idle needs to be handled first as the IDLE bit will be cleared by a read of
  // scsr followed by a read of scrq[0:16]

  if(queue_pointer > mpc555_chan->rx_last_queue_pointer){
    start = mpc555_chan->rx_last_queue_pointer;
    space_req = mpc555_serial_read_queue(chan, start, queue_pointer - 1);
  }
  else {// Its wrapped around
    if(mpc555_chan->rx_last_queue_pointer > queue_pointer){
      space_req = mpc555_serial_read_queue(chan, mpc555_chan->rx_last_queue_pointer,15);
      if(queue_pointer != 0){
        mpc555_serial_read_queue(chan, 0,queue_pointer -1); 
      }
    }
    else // No new data to read, do nothing here
    {
    }
  }

  mpc555_chan->rx_last_queue_pointer = queue_pointer;
    
  if(CYGARC_REG_IMM_QSCI1SR_QOR & qscisr){
    // Need to re-enable the queue
    cyg_uint16 qscicr;
    HAL_READ_UINT16( CYGARC_REG_IMM_QSCI1CR, qscicr);
    qscicr |= ((cyg_uint16)CYGARC_REG_IMM_QSCI1CR_QRE);
    HAL_WRITE_UINT16( CYGARC_REG_IMM_QSCI1CR, qscicr);
    // Queue has overrun but data might not have been lost yet
    if(scsr & MPC555_SERIAL_SCxSR_OR){  
#ifdef CYGOPT_IO_SERIAL_SUPPORT_LINE_STATUS
      cyg_serial_line_status_t stat;
      stat.which = CYGNUM_SERIAL_STATUS_OVERRUNERR;
      (chan->callbacks->indicate_status)(chan, &stat);    
#endif
    }
  }

  if(scsr & (cyg_uint16)MPC555_SERIAL_SCxSR_ERRORS){
    // Special case for queue overrun handled above.
    // Only data without FE or PF is allowed into the queue.
    // Data with NE is allowed into the queue.
    // If FE or PF have occured then the queue is disabled
    // until they are cleared (by reading scsr then scdr).
    
#ifdef CYGOPT_IO_SERIAL_SUPPORT_LINE_STATUS
    cyg_serial_line_status_t stat;
    if(scsr & MPC555_SERIAL_SCxSR_NF){
      // Note if there is more than one frame in the queue
      // it is not possible to tell which frame
      // in the queue caused the noise error.
      // The error has already been cleared by reading
      // srsr then scrq[n], so no action is required here.
      stat.which = CYGNUM_SERIAL_STATUS_NOISEERR;
      (chan->callbacks->indicate_status)(chan, &stat);
    } 
#endif 
    if(scsr & (MPC555_SERIAL_SCxSR_FE | MPC555_SERIAL_SCxSR_PF)){
      // This action needs to be taken clear the status bits so that
      // the queue can be re-enabled.
      HAL_READ_UINT16(port + MPC555_SERIAL_SCxDR, scdr);
      // Need to re-enable the queue
      cyg_uint16 qscicr;
      HAL_READ_UINT16(CYGARC_REG_IMM_QSCI1CR, qscicr);
      qscicr |= ((cyg_uint16)CYGARC_REG_IMM_QSCI1CR_QRE);
      HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1CR, qscicr);
      
#ifdef CYGOPT_IO_SERIAL_SUPPORT_LINE_STATUS
      if(scsr & MPC555_SERIAL_SCxSR_FE){
        stat.which = CYGNUM_SERIAL_STATUS_FRAMEERR;
        (chan->callbacks->indicate_status)(chan, &stat);
      }   
      if(scsr & MPC555_SERIAL_SCxSR_PF){
        stat.which = CYGNUM_SERIAL_STATUS_PARITYERR;
        (chan->callbacks->indicate_status)(chan, &stat);
      }
#endif
    }
  }
  if(QTHF){
    qscisr &= ~((cyg_uint16)CYGARC_REG_IMM_QSCI1SR_QTHF);
    HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
    //cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_queue_top_full_num);
  }
  if(QBHF){
    qscisr &= ~((cyg_uint16)CYGARC_REG_IMM_QSCI1SR_QBHF);
    HAL_WRITE_UINT16(CYGARC_REG_IMM_QSCI1SR, qscisr);
    //cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_queue_bot_full_num);
  }
  if(idle){
    if(idle && !space_req){
      // The IDLE flag can be set sometimes when RE is set
      // so a read of scrq is needed to clear it.
      // If this occurs there should be no new data yet otherwise the
      // condition is impossible to detect
      HAL_READ_UINT16(CYGARC_REG_IMM_SCRQ, scrq);
    }
    HAL_READ_UINT16(CYGARC_REG_IMM_SCRQ, scrq);
    //cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_idle_line_num);
  }
  // A bit lasy, but we don't know or care what the original ISR source
  // was so to cover all bases re-enble them all
  cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_queue_top_full_num);
  cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_queue_bot_full_num);
  cyg_drv_interrupt_unmask(mpc555_chan->rx_interrupt_idle_line_num);
}

static int mpc555_serial_read_queue(serial_channel* chan, int start, int end)
{
  int block_index = 0;
  cyg_uint16 scrq;
  cyg_addrword_t i;
  unsigned char* space;
  int space_avail = 0;
  int space_req = end - start + 1;
  if((space_req > 0) && 
     ((chan->callbacks->data_rcv_req)
      (chan, space_req, &space_avail, &space) == CYG_RCV_OK)) {
    CYG_ASSERT((start >= 0) && (start < 16),"rx queue read start point out of range");
    CYG_ASSERT(start <= end,"rx queue read start and end points reversed");
    for(i=start ;i < (start + space_avail); i++){
      CYG_ASSERT((i >= 0) && (i < 16),"rx queue read out of range");
      HAL_READ_UINT16(CYGARC_REG_IMM_SCRQ + (i * 2), scrq);
      space[block_index] = scrq;
      ++block_index;
    } 
    (chan->callbacks->data_rcv_done)(chan,space_avail);
#ifdef CYGOPT_IO_SERIAL_SUPPORT_LINE_STATUS    
// If there's not enough room data will be lost.
// There's no point calling rcv_char because the reader is blocked by this DSR.
    if(space_avail < space_req){
      cyg_serial_line_status_t stat;
      stat.which = CYGNUM_SERIAL_STATUS_OVERRUNERR;
      (chan->callbacks->indicate_status)(chan, &stat); 
    }
#endif   
  }
  return space_req;
}
#endif // SERIAL_A
#endif // CYGPKG_IO_SERIAL_POWERPC_MPC555

// EOF mpc555_serial_with_ints.c

